Revit 2027 API
ParameterTypeId.FamilyKeywordProtected Property
 "Content protection enabled"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyKeywordProtected { get; }
Public Shared ReadOnly Property FamilyKeywordProtected As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyKeywordProtected {
	ForgeTypeId^ get ();
}
static member FamilyKeywordProtected : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace